README.org
*** =C-c o= Org bindings
#+begin_src emacs-lisp
(global-set-key (kbd "C-c o a") #'org-agenda)
(global-set-key (kbd "C-c o b d") #'org-babel-detangle)
(global-set-key (kbd "C-c o b o") #'org-babel-tangle-jump-to-org)
(global-set-key (kbd "C-c o b s") #'renz/org-babel-tangle-jump-to-src)
(global-set-key (kbd "C-c o j") #'consult-org-heading)
(global-set-key (kbd "C-c o o") #'renz/jump-org)
(global-set-key (kbd "C-c o w") #'renz/org-kill-src-block)
#+end_src


#+begin_src emacs-lisp
;; (global-set-key (kbd "C-c p") #')
;; (global-set-key (kbd "C-c q") #')
#+end_src

#+begin_src emacs-lisp
(global-set-key (kbd "C-c r") #'renz/recentf-find-file)
#+end_src

*** =C-c s= Settings

#+begin_src emacs-lisp
(global-set-key (kbd "C-c s i") #'renz/jump-init)
;; (global-set-key (kbd "C-c s k") #'renz/jump-keybindings)
;; (global-set-key (kbd "C-c s s") #'renz/jump-configuration)
#+end_src


#+begin_src emacs-lisp
;; (global-set-key (kbd "C-c t") #')
#+end_src

*** =C-c u= Consult grep/rg

#+begin_src emacs-lisp
(global-set-key (kbd "C-c u") #'renz/consult-grep)
#+end_src

*** =C-c v=

#+begin_src emacs-lisp
;; (global-set-key (kbd "C-c v") #')
#+end_src

#+begin_src emacs-lisp
;; (global-set-key (kbd "C-c w") #')
#+end_src

#+begin_src emacs-lisp
;; (global-set-key (kbd "C-c x") #')
#+end_src

*** =C-c y= Yank inner/outer

#+begin_src emacs-lisp
(global-set-key (kbd "C-c y i") #'copy-inner)
(global-set-key (kbd "C-c y o") #'copy-outer)
#+end_src

*** =C-c z=

#+begin_src emacs-lisp
;; (global-set-key (kbd "C-c z") #')
#+end_src

*** =C-c= Other bindings

#+begin_src emacs-lisp
(global-set-key (kbd "C-c ;") #'comment-line)  ; TTY-friendly
(global-set-key (kbd "C-c <DEL>") #'backward-kill-sexp)  ;; TTY-frindly
#+end_src

** Meta/Alt Modifications
#+begin_src emacs-lisp
(with-eval-after-load 'dired
  (define-key dired-mode-map (kbd "M-S-j") 'dired-goto-file))
#+end_src

** F5-F9
Like the =C-c <letter>= bindings, these are reserved for users.

#+begin_src emacs-lisp
(global-set-key (kbd "<f5>") #'compile)
(global-set-key (kbd "M-<f5>") #'recompile)
;; (global-set-key (kbd "<f6>") #')
;; (global-set-key (kbd "M-<f6>") #')
;; (global-set-key (kbd "<f7>") #')
;; (global-set-key (kbd "M-<f7>") #')
;; (global-set-key (kbd "<f8>") #')
;; (global-set-key (kbd "M-<f8>") #')
(global-set-key (kbd "<f9>") #'vterm)
(global-set-key (kbd "M-<f9>") #'eshell)
(global-set-key (kbd "S-<f9>") #'ansi-term)
(global-set-key (kbd "s-<f9>") #'shell)
#+end_src

** Nonstandard bindings

#+begin_src emacs-lisp
(when (eq system-type 'darwin)
  (with-eval-after-load 'projectile
    (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)))
#+end_src

** Super bindings
See the [[Windows][Microsoft Windows]] section for some hackery required to get these working on more platforms.

#+begin_src emacs-lisp
(global-set-key (kbd "s-s") #'save-buffer)
#+end_src


* Misc. Settings
Haven't found a home header for any of these yet.

** Fill-column
For visual lines, this adds line breaks at the fill-column value.  Especially useful for prose that is meant to be copied to other mediums, such as email or word.
#+begin_src emacs-lisp
(add-hook 'visual-line-mode-hook #'visual-fill-column-mode)
(setq-default fill-column 120)
#+end_src

** Scroll bar
I toggle this one on/off sometimes depending on how I feel lately.

#+begin_src emacs-lisp
;; Scroll bar
(scroll-bar-mode -1)
#+end_src

** Inline emojis
I tried this for a while but boy did it consume a lot of space in the =elpa/= directory!  If I go back to it I might re-install it but have to ensure I ignore the source files.

#+begin_src emacs-lisp
;; Emojis inline 👍
;; (add-hook 'after-init-hook #'global-emojify-mode)
#+end_src

** Inihibit splash screen
I can always get back to the OG GNU Spash with =C-h C-a=

#+begin_src emacs-lisp
(setq inhibit-splash-screen t)
#+end_src

** Automatically visit symlink sources

#+begin_src emacs-lisp
(setq find-file-visit-truename t)
(setq vc-follow-symlinks t)
#+end_src

** Indent with spaces

#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
#+end_src

** Render ASCII color escape codes
For files containing color escape codes, this provides a way to render the colors in-buffer.

#+begin_src emacs-lisp
(defun renz/display-ansi-colors ()
  (interactive)
  (require 'ansi-color)
  (ansi-color-apply-on-region (point-min) (point-max)))
#+end_src

** Enable horizontal scrolling with mouse
From a helpful [[https://stackoverflow.com/a/67758169][stackoverflow answer.]]
#+begin_src emacs-lisp
(setq mouse-wheel-tilt-scroll t)
#+end_src

** Window management
I need to give the [[https://www.masteringemacs.org/article/demystifying-emacs-window-manager][article]] another read about what's going on, but it seems helpful.

#+begin_src emacs-lisp
(unless (version< emacs-version "27.1")
  (setq switch-to-buffer-obey-display-actions t))
#+end_src

** Enable up/downcase-region

#+begin_src emacs-lisp
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)
#+end_src

** Automatically update buffers when contents change on disk

#+begin_src emacs-lisp
(global-auto-revert-mode)
#+end_src

** Initial frame size for GUI

#+begin_src emacs-lisp
(setq renz/frame-default-alist
      '(
        (tool-bar-lines . 0)
        (width . 180) ; chars
        (height . 60) ; lines
        (left . 125)
        (top . 125)))

(when (display-graphic-p)
  (setq initial-frame-alist renz/frame-default-alist)
  (setq default-frame-alist renz/frame-default-alist))
#+end_src

** Marginalia
Adds helpful information in the margin when using the minibuffer

#+begin_src emacs-lisp
(use-package marginalia
  :ensure t
  :config (marginalia-mode))
#+end_src

** Highlight the line point is on

#+begin_src emacs-lisp
(global-hl-line-mode)
#+end_src

** Stop stupid bell
This snippet has a special place in my heart, because it was the first two lines of elisp I wrote when first learning Emacs.

#+begin_src emacs-lisp
;; Stop stupid bell
(setq ring-bell-function 'ignore)
#+end_src

** TODO Clock in mode line
Move this to the [[Mode line][mode line]] section

#+begin_src emacs-lisp
(setq display-time-day-and-date t)
(display-time)
#+end_src

** Enable split-window dired copying

#+begin_src emacs-lisp
(setq dired-dwim-target t)
#+end_src

** Automatically create matching parens in programming modes

#+begin_src emacs-lisp
(add-hook 'prog-mode-hook (electric-pair-mode t))
(add-hook 'prog-mode-hook (show-paren-mode t))
#+end_src

** TODO Delete whitespace on save
I would also like to have a good-looking display for trailing whitespace and leading tabs like in my Neovim setup, but its proven challenging to just narrow down to those two faces.
#+begin_src emacs-lisp
;; (add-hook 'prog-mode-hook 'whitespace-mode)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src

** Don't wrap lines

#+begin_src emacs-lisp
(setq-default truncate-lines t)
(add-hook 'eshell-mode-hook (toggle-truncate-lines nil))
#+end_src

** Relative line numbers
For programming and prose/writing modes.

#+begin_src emacs-lisp
(defun renz/display-line-numbers ()
  (setq display-line-numbers 'relative))
#+end_src

Unfortunately, line numbers are displayed in the text area of the buffer, but org-modern uses the fringe to display source blocks.  [[https://www.reddit.com/r/emacs/comments/ymprwi/comment/iv5iafb/?utm_source=share&utm_medium=web2x&context=3][There's no way to display them to the left]] of the fringe, so I'm careful about only turning on line numbers in modes that I think I'll benefit from it.  It's been working pretty well in org-mode without the line numbers so far, since for each of the code blocks I can always use =C-c '= to edit in ~prog-mode~, where I /do/ get line numbers.

#+begin_src emacs-lisp
(add-hook 'prog-mode-hook 'renz/display-line-numbers)
#+end_src

** Delete region when we yank on top of it
I just think that's a funny sentence, whatever we may think of it.

#+begin_src emacs-lisp
(delete-selection-mode t)
#+end_src

