init.el

;; [[file:README.org::*=C-c o= Org bindings][=C-c o= Org bindings:1]]
(global-set-key (kbd "C-c o a") #'org-agenda)
(global-set-key (kbd "C-c o b d") #'org-babel-detangle)
(global-set-key (kbd "C-c o b o") #'org-babel-tangle-jump-to-org)
(global-set-key (kbd "C-c o b s") #'renz/org-babel-tangle-jump-to-src)
(global-set-key (kbd "C-c o o") #'renz/jump-org)
(global-set-key (kbd "C-c o w") #'renz/org-kill-src-block)
;; =C-c o= Org bindings:1 ends here

;; [[file:README.org::*=C-c o= Org bindings][=C-c o= Org bindings:2]]
;; (global-set-key (kbd "C-c p") #')
;; (global-set-key (kbd "C-c q") #')
;; =C-c o= Org bindings:2 ends here

;; [[file:README.org::*=C-c o= Org bindings][=C-c o= Org bindings:3]]
(global-set-key (kbd "C-c r") #'renz/recentf-find-file)
;; =C-c o= Org bindings:3 ends here

;; [[file:README.org::*=C-c s= Settings][=C-c s= Settings:1]]
(global-set-key (kbd "C-c s i") #'renz/jump-init)
;; (global-set-key (kbd "C-c s k") #'renz/jump-keybindings)
;; (global-set-key (kbd "C-c s s") #'renz/jump-configuration)
;; =C-c s= Settings:1 ends here

;; [[file:README.org::*=C-c s= Settings][=C-c s= Settings:2]]
;; (global-set-key (kbd "C-c t") #')
;; =C-c s= Settings:2 ends here

;; [[file:README.org::*=C-c u= Consult grep/rg][=C-c u= Consult grep/rg:1]]
(global-set-key (kbd "C-c u") #'renz/consult-grep)
;; =C-c u= Consult grep/rg:1 ends here

;; [[file:README.org::*=C-c v=][=C-c v=:1]]
;; (global-set-key (kbd "C-c v") #')
;; =C-c v=:1 ends here

;; [[file:README.org::*=C-c v=][=C-c v=:2]]
;; (global-set-key (kbd "C-c w") #')
;; =C-c v=:2 ends here

;; [[file:README.org::*=C-c v=][=C-c v=:3]]
;; (global-set-key (kbd "C-c x") #')
;; =C-c v=:3 ends here

;; [[file:README.org::*=C-c y= Yank inner/outer][=C-c y= Yank inner/outer:1]]
(global-set-key (kbd "C-c y i") #'copy-inner)
(global-set-key (kbd "C-c y o") #'copy-outer)
;; =C-c y= Yank inner/outer:1 ends here

;; [[file:README.org::*=C-c z=][=C-c z=:1]]
;; (global-set-key (kbd "C-c z") #')
;; =C-c z=:1 ends here

;; [[file:README.org::*=C-c= Other bindings][=C-c= Other bindings:1]]
(global-set-key (kbd "C-c ;") #'comment-line)  ; TTY-friendly
(global-set-key (kbd "C-c <DEL>") #'backward-kill-sexp)  ;; TTY-frindly
;; =C-c= Other bindings:1 ends here

;; [[file:README.org::*Meta/Alt Modifications][Meta/Alt Modifications:1]]
(with-eval-after-load 'dired
  (define-key dired-mode-map (kbd "M-S-j") 'dired-goto-file))
;; Meta/Alt Modifications:1 ends here

;; [[file:README.org::*F5-F9][F5-F9:1]]
(global-set-key (kbd "<f5>") #'compile)
(global-set-key (kbd "M-<f5>") #'recompile)
;; (global-set-key (kbd "<f6>") #')
;; (global-set-key (kbd "M-<f6>") #')
;; (global-set-key (kbd "<f7>") #')
;; (global-set-key (kbd "M-<f7>") #')
;; (global-set-key (kbd "<f8>") #')
;; (global-set-key (kbd "M-<f8>") #')
(global-set-key (kbd "<f9>") #'vterm)
(global-set-key (kbd "M-<f9>") #'eshell)
(global-set-key (kbd "S-<f9>") #'ansi-term)
(global-set-key (kbd "s-<f9>") #'shell)
;; F5-F9:1 ends here

;; [[file:README.org::*Nonstandard bindings][Nonstandard bindings:1]]
(when (eq system-type 'darwin)
  (with-eval-after-load 'projectile
    (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)))
;; Nonstandard bindings:1 ends here

;; [[file:README.org::*Super bindings][Super bindings:1]]
(global-set-key (kbd "s-s") #'save-buffer)
;; Super bindings:1 ends here

;; [[file:README.org::*Fill-column][Fill-column:1]]
(add-hook 'visual-line-mode-hook #'visual-fill-column-mode)
(setq-default fill-column 120)
;; Fill-column:1 ends here

;; [[file:README.org::*Scroll bar][Scroll bar:1]]
;; Scroll bar
(scroll-bar-mode -1)
;; Scroll bar:1 ends here

;; [[file:README.org::*Inline emojis][Inline emojis:1]]
;; Emojis inline 👍
;; (add-hook 'after-init-hook #'global-emojify-mode)
;; Inline emojis:1 ends here

;; [[file:README.org::*Inihibit splash screen][Inihibit splash screen:1]]
(setq inhibit-splash-screen t)
;; Inihibit splash screen:1 ends here

;; [[file:README.org::*Automatically visit symlink sources][Automatically visit symlink sources:1]]
(setq find-file-visit-truename t)
(setq vc-follow-symlinks t)
;; Automatically visit symlink sources:1 ends here

;; [[file:README.org::*Indent with spaces][Indent with spaces:1]]
(setq-default indent-tabs-mode nil)
;; Indent with spaces:1 ends here

;; [[file:README.org::*Render ASCII color escape codes][Render ASCII color escape codes:1]]
(defun renz/display-ansi-colors ()
  (interactive)
  (require 'ansi-color)
  (ansi-color-apply-on-region (point-min) (point-max)))
;; Render ASCII color escape codes:1 ends here

;; [[file:README.org::*Enable horizontal scrolling with mouse][Enable horizontal scrolling with mouse:1]]
(setq mouse-wheel-tilt-scroll t)
;; Enable horizontal scrolling with mouse:1 ends here

;; [[file:README.org::*Window management][Window management:1]]
(unless (version< emacs-version "27.1")
  (setq switch-to-buffer-obey-display-actions t))
;; Window management:1 ends here

;; [[file:README.org::*Enable up/downcase-region][Enable up/downcase-region:1]]
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)
;; Enable up/downcase-region:1 ends here

;; [[file:README.org::*Automatically update buffers when contents change on disk][Automatically update buffers when contents change on disk:1]]
(global-auto-revert-mode)
;; Automatically update buffers when contents change on disk:1 ends here

;; [[file:README.org::*Initial frame size for GUI][Initial frame size for GUI:1]]
(setq renz/frame-default-alist
      '(
        (tool-bar-lines . 0)
        (width . 180) ; chars
        (height . 60) ; lines
        (left . 125)
        (top . 125)))

(when (display-graphic-p)
  (setq initial-frame-alist renz/frame-default-alist)
  (setq default-frame-alist renz/frame-default-alist))
;; Initial frame size for GUI:1 ends here

;; [[file:README.org::*Marginalia][Marginalia:1]]
(use-package marginalia
  :ensure t
  :config (marginalia-mode))
;; Marginalia:1 ends here

;; [[file:README.org::*Highlight the line point is on][Highlight the line point is on:1]]
(global-hl-line-mode)
;; Highlight the line point is on:1 ends here

;; [[file:README.org::*Stop stupid bell][Stop stupid bell:1]]
;; Stop stupid bell
(setq ring-bell-function 'ignore)
;; Stop stupid bell:1 ends here

;; [[file:README.org::*Clock in mode line][Clock in mode line:1]]
(setq display-time-day-and-date t)
(display-time)
;; Clock in mode line:1 ends here

;; [[file:README.org::*Enable split-window dired copying][Enable split-window dired copying:1]]
(setq dired-dwim-target t)
;; Enable split-window dired copying:1 ends here

;; [[file:README.org::*Automatically create matching parens in programming modes][Automatically create matching parens in programming modes:1]]
(add-hook 'prog-mode-hook (electric-pair-mode t))
(add-hook 'prog-mode-hook (show-paren-mode t))
;; Automatically create matching parens in programming modes:1 ends here

;; [[file:README.org::*Delete whitespace on save][Delete whitespace on save:1]]
;; (add-hook 'prog-mode-hook 'whitespace-mode)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
;; Delete whitespace on save:1 ends here

;; [[file:README.org::*Don't wrap lines][Don't wrap lines:1]]
(setq-default truncate-lines t)
(add-hook 'eshell-mode-hook (toggle-truncate-lines nil))
;; Don't wrap lines:1 ends here

;; [[file:README.org::*Relative line numbers][Relative line numbers:1]]
(defun renz/display-line-numbers ()
  (setq display-line-numbers 'relative))
;; Relative line numbers:1 ends here

;; [[file:README.org::*Relative line numbers][Relative line numbers:2]]
(add-hook 'prog-mode-hook 'renz/display-line-numbers)
;; Relative line numbers:2 ends here

;; [[file:README.org::*Delete region when we yank on top of it][Delete region when we yank on top of it:1]]
(delete-selection-mode t)
;; Delete region when we yank on top of it:1 ends here
