README.org
** Enable mouse in terminal/TTY

#+begin_src emacs-lisp
(xterm-mouse-mode 1)
#+end_src

** Compilation
As new text appears, the default behavior is for it to spill off the bottom where we can't see it.  This causes the window to follow new text as it is printed.

#+begin_src emacs-lisp
(setq compilation-scroll-output t)
#+end_src

Enable colors in the =*compilation*= buffer.  Provided by a [[https://stackoverflow.com/a/3072831/13215205][helpful stackoverflow answer]].

#+begin_src emacs-lisp
;; Enable colors in *compilation* buffer: https://stackoverflow.com/a/3072831/13215205
(defun renz/colorize-compilation-buffer ()
  "Enable colors in the *compilation* buffer."
  (require 'ansi-color)
  (let ((inhibit-read-only t))
    (ansi-color-apply-on-region (point-min) (point-max))))

(add-hook 'compilation-filter-hook 'renz/colorize-compilation-buffer)
#+end_src

** Tool bar
I usually leave the tool bar disabled
#+begin_src emacs-lisp
(tool-bar-mode -1)
#+end_src

The MENU bar, on the other hand =(menu-bar-mode)=, is very handy, and I don't think I'll ever disable it.

** TODO Show laptop battery
Move this to mode-line configuration

#+begin_src emacs-lisp
(display-battery-mode t)
#+end_src

** Ignore risky .dir-locals.el
From an [[https://emacs.stackexchange.com/a/44604][Emacs stackexchange]] answer.

#+begin_src emacs-lisp
(advice-add 'risky-local-variable-p :override #'ignore)
#+end_src

** Prefer =rg= over =grep=

#+begin_src emacs-lisp
(when (executable-find "rg")
  (setq grep-program "rg"))
#+end_src

** Make ~dired~ human-readable

#+begin_src emacs-lisp
(setq dired-listing-switches "-alFh")
(setq-default dired-hide-details-mode t)
#+end_src

** Confirm when exiting Emacs

#+begin_src emacs-lisp
(setq confirm-kill-emacs 'yes-or-no-p)
#+end_src

** Prefer ~aspell~ over ~ispell~

#+begin_src emacs-lisp
(when (executable-find "aspell")
  (setq ispell-program-name "aspell"))
#+end_src

** Smooth scrolling

#+begin_src emacs-lisp
(if (version< emacs-version "29.0")
    (pixel-scroll-mode)
  (pixel-scroll-precision-mode 1)
  (setq pixel-scroll-precision-large-scroll-height 35.0))
#+end_src

** Backup files
Keep all backup and auto-save files in a temporary folder.
#+begin_src emacs-lisp
(setq backup-directory-alist
      `(("." . temporary-file-directory))
      auto-save-file-name-transforms
      `(("." ,temporary-file-directory t)))
#+end_src

** Code syntax in Markdown
Enable syntax highlighting within code fences for markdown

#+begin_src emacs-lisp
(add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode))
#+end_src

** Esup
[[https://github.com/jschaf/esup][esup]] is a tool for profiling the startup time of emacs.  This snippet is a work around of a bug where esup tries to step into the byte-compiled version of `cl-lib', and fails horribly: https://github.com/jschaf/esup/issues/85

#+begin_src emacs-lisp
(setq esup-depth 0)
#+end_src


* Minimap
I have a love-hate relationship with the minimap.  Sometimes it feels great, especially when I'm doing a mouse-heavy demo for navigation.  Other times it blocks the echo area when the window is too small and it drives me crazy.

#+begin_src emacs-lisp
(use-package minimap
  :config
  (when (display-graphic-p)
    (minimap-mode t)))
#+end_src

* Mode line

#+begin_src emacs-lisp
(setq column-number-mode t
      mode-line-in-non-selected-windows t)
#+end_src

#+RESULTS:
: t


* =eldoc=
I find it very distracting when =eldoc= suddenly pops up and consumes a large part of the screen for docstrings in python.

#+begin_src emacs-lisp
(setq eldoc-echo-area-use-multiline-p nil)
#+end_src

#+RESULTS:
: t


* Autocompletion
Emacs offers incredible depth and freedom when configuring methods that automatically complete text.  First, we set the "completion style", which is the method of assigning completion candidates to a given input string.  "flex" is the built-in "fuzzy" completion style, familiar to us from command prompts in IDEs and VSCode's command palette.

#+begin_src emacs-lisp
(setq completion-styles '(flex basic partial-completion emacs22))
#+end_src

I've found the [[https://github.com/oantolin/orderless][orderless]] completion style especially well-suited to Emacs.

#+begin_src emacs-lisp
(use-package orderless
  :ensure t
  :config
  (add-to-list 'completion-styles 'orderless)
  :custom
  (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src

With the /completion style/ set, we have to now configure the interfaces for /displaying/ candidates as we type.  The natural place to start would be the built-in ~*Completions*~ buffer.  First, I want candidates displayed as a single, vertical list.

#+begin_src emacs-lisp
(setq completions-format 'one-column)
#+end_src

If there is a convenient way to interact with this buffer from default key bindings, I am not aware of it.  Because of this, I set a few convenience functions for navigating to, selecting, and closing the ~*Completions*~ buffer in the case I do need to use it.

#+begin_src emacs-lisp
(defun renz/completion-accept ()
  "Expand current text to first completion result"
  (interactive)
  ;; FIXME In python REPL, if we go back inside a symbol and edit it
  ;;       to narrow the candidate list, then accept something with
  ;;       this function, the trailing text isn't erased
  (switch-to-completions)
  (choose-completion))

(defun renz/jump-completion ()
  "Jump to second completion."
  (interactive)
  (switch-to-completions)
  (next-completion 1))

(defun renz/completion-kill-completion-buffer ()
  "Close the *Completions* buffer without switching to it"
  (interactive)
  (kill-buffer "*Completions*"))
#+end_src

Much like Vim's built-in completion with the pop-up menu, I set =C-n= and =C-p= as a way to select completion candidates out of the ~*Completions*~ buffer.

#+begin_src emacs-lisp
(define-key completion-in-region-mode-map (kbd "C-n") 'renz/jump-completion)
(define-key completion-list-mode-map (kbd "C-n") 'next-completion)
(define-key completion-list-mode-map (kbd "C-p") 'previous-completion)
#+end_src

For a while, I thought keys like =RET=, =TAB=, and similar would be intuitive candidates for accepting completion candidates.  That turned out to be a problem because there's a good chance you'll mess up required functionality in shell, minibuffer, and related modes.  So, instead, I opt for the similar =C-j=.

#+begin_src emacs-lisp
(define-key completion-in-region-mode-map (kbd "C-j") 'renz/completion-accept)
(define-key completion-list-mode-map (kbd "C-j") 'choose-completion)
#+end_src

It's worth noting that the ~fido-vertical~ built-in is pretty good, but I had issues with micro-freezes in some situations.  [[https://github.com/minad/vertico][vertico]], on the other hand, has been lightning quick, and has intuitive keybindings that don't require any futzing.  /Especially/ in the case where I'm looking to tab-complete things like =C-x C-f /ssh:<thing>=.

#+begin_src emacs-lisp
(vertico-mode)
#+end_src

Emacs uses =M-TAB=, or the equivalent =C-M-i= for ~completion-at-point~.  I'd much prefer to just use the easier and more intuitive =TAB=.

#+begin_src emacs-lisp
(setq tab-always-indent 'complete)
#+end_src

** =company-mode=
This section is obsolete and not tangled into the final ~init.el~, since I don't use company anymore.  I do keep it around for historical reasons, though, in case if I ever decide to go back.

#+begin_src emacs-lisp :tangle no
;; Company causes TRAMP to hang if we look for commands too fast
(defun renz/disable-company-remote-shell ()
  (when (and (fboundp 'company-mode)
             (file-remote-p default-directory))
    (company-mode -1)))

(add-hook 'after-init-hook 'global-company-mode)
(add-hook 'shell-mode-hook 'renz/disable-company-remote-shell)
(setq company-minimum-prefix-length 2)
(setq company-idle-delay
      (lambda () (if (company-in-string-or-comment) nil 0.0)))
(setq company-tooltip-align-annotations t)
(setq company-tooltip-flip-when-above t)
(setq company-tooltip-margin 2)
#+end_src

** =corfu=
Provides popup, suggest-as-you type like we would expect from any modern IDE.  I like =corfu= a lot, since it's philosophy is to stick as close as possible to the native Emacs internal API as possible, without inventing the whell.  In my experience, this has meant far fewer integration troubles with other packages that follow the same ideology.

#+begin_src emacs-lisp
(unless (display-graphic-p)
  (corfu-terminal-mode +1))

(defun renz/disable-corfu-remote ()
  (when (and (fboundp 'corfu-mode)
             (file-remote-p default-directory))
    (corfu-mode -1)))

(setq corfu-auto t
      corfu-auto-delay 0.0
      corfu-quit-no-match 'separator)

(global-corfu-mode)
#+end_src


