init.el

;; [[file:README.org::*Enable mouse in terminal/TTY][Enable mouse in terminal/TTY:1]]
(xterm-mouse-mode 1)
;; Enable mouse in terminal/TTY:1 ends here

;; [[file:README.org::*Compilation][Compilation:1]]
(setq compilation-scroll-output t)
;; Compilation:1 ends here

;; [[file:README.org::*Compilation][Compilation:2]]
;; Enable colors in *compilation* buffer: https://stackoverflow.com/a/3072831/13215205
(defun renz/colorize-compilation-buffer ()
  "Enable colors in the *compilation* buffer."
  (require 'ansi-color)
  (let ((inhibit-read-only t))
    (ansi-color-apply-on-region (point-min) (point-max))))

(add-hook 'compilation-filter-hook 'renz/colorize-compilation-buffer)
;; Compilation:2 ends here

;; [[file:README.org::*Tool bar][Tool bar:1]]
(tool-bar-mode -1)
;; Tool bar:1 ends here

;; [[file:README.org::*Show laptop battery][Show laptop battery:1]]
(display-battery-mode t)
;; Show laptop battery:1 ends here

;; [[file:README.org::*Ignore risky .dir-locals.el][Ignore risky .dir-locals.el:1]]
(advice-add 'risky-local-variable-p :override #'ignore)
;; Ignore risky .dir-locals.el:1 ends here

;; [[file:README.org::*Prefer =rg= over =grep=][Prefer =rg= over =grep=:1]]
(when (executable-find "rg")
  (setq grep-program "rg"))
;; Prefer =rg= over =grep=:1 ends here

;; [[file:README.org::*Make ~dired~ human-readable][Make ~dired~ human-readable:1]]
(setq dired-listing-switches "-alFh")
(setq-default dired-hide-details-mode t)
;; Make ~dired~ human-readable:1 ends here

;; [[file:README.org::*Confirm when exiting Emacs][Confirm when exiting Emacs:1]]
(setq confirm-kill-emacs 'yes-or-no-p)
;; Confirm when exiting Emacs:1 ends here

;; [[file:README.org::*Prefer ~aspell~ over ~ispell~][Prefer ~aspell~ over ~ispell~:1]]
(when (executable-find "aspell")
  (setq ispell-program-name "aspell"))
;; Prefer ~aspell~ over ~ispell~:1 ends here

;; [[file:README.org::*Smooth scrolling][Smooth scrolling:1]]
(if (version< emacs-version "29.0")
    (pixel-scroll-mode)
  (pixel-scroll-precision-mode 1)
  (setq pixel-scroll-precision-large-scroll-height 35.0))
;; Smooth scrolling:1 ends here

;; [[file:README.org::*Backup files][Backup files:1]]
(setq backup-directory-alist
      `((".*" . temporary-file-directory,))
      auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))
;; Backup files:1 ends here

;; [[file:README.org::*Code syntax in Markdown][Code syntax in Markdown:1]]
(add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode))
;; Code syntax in Markdown:1 ends here

;; [[file:README.org::*Esup][Esup:1]]
(setq esup-depth 0)
;; Esup:1 ends here

;; [[file:README.org::*Minimap][Minimap:1]]
(use-package minimap
  :config
  (when (display-graphic-p)
    (minimap-mode t)))
;; Minimap:1 ends here

;; [[file:README.org::*Mode line][Mode line:1]]
(setq column-number-mode t
      mode-line-in-non-selected-windows t)
;; Mode line:1 ends here

;; [[file:README.org::*=eldoc=][=eldoc=:1]]
(setq eldoc-echo-area-use-multiline-p nil)
;; =eldoc=:1 ends here

;; [[file:README.org::*Autocompletion][Autocompletion:1]]
(setq completion-styles '(flex basic partial-completion emacs22))
;; Autocompletion:1 ends here

;; [[file:README.org::*Autocompletion][Autocompletion:2]]
(use-package orderless
  :ensure t
  :config
  (add-to-list 'completion-styles 'orderless)
  :custom
  (completion-category-overrides '((file (styles basic partial-completion)))))
;; Autocompletion:2 ends here

;; [[file:README.org::*Autocompletion][Autocompletion:3]]
(setq completions-format 'one-column)
;; Autocompletion:3 ends here

;; [[file:README.org::*Autocompletion][Autocompletion:4]]
(defun renz/completion-accept ()
  "Expand current text to first completion result"
  (interactive)
  ;; FIXME In python REPL, if we go back inside a symbol and edit it
  ;;       to narrow the candidate list, then accept something with
  ;;       this function, the trailing text isn't erased
  (switch-to-completions)
  (choose-completion))

(defun renz/jump-completion ()
  "Jump to second completion."
  (interactive)
  (switch-to-completions)
  (next-completion 1))

(defun renz/completion-kill-completion-buffer ()
  "Close the *Completions* buffer without switching to it"
  (interactive)
  (kill-buffer "*Completions*"))
;; Autocompletion:4 ends here

;; [[file:README.org::*Autocompletion][Autocompletion:5]]
(define-key completion-in-region-mode-map (kbd "C-n") 'renz/jump-completion)
(define-key completion-list-mode-map (kbd "C-n") 'next-completion)
(define-key completion-list-mode-map (kbd "C-p") 'previous-completion)
;; Autocompletion:5 ends here

;; [[file:README.org::*Autocompletion][Autocompletion:6]]
(define-key completion-in-region-mode-map (kbd "C-j") 'renz/completion-accept)
(define-key completion-list-mode-map (kbd "C-j") 'choose-completion)
;; Autocompletion:6 ends here

;; [[file:README.org::*Autocompletion][Autocompletion:7]]
(vertico-mode)
;; Autocompletion:7 ends here

;; [[file:README.org::*Autocompletion][Autocompletion:8]]
(setq tab-always-indent 'complete)
;; Autocompletion:8 ends here

;; [[file:README.org::*=corfu=][=corfu=:1]]
(unless (display-graphic-p)
  (corfu-terminal-mode +1))

(defun renz/disable-corfu-remote ()
  (when (and (fboundp 'corfu-mode)
             (file-remote-p default-directory))
    (corfu-mode -1)))

(setq corfu-auto t
      corfu-auto-delay 0.0
      corfu-quit-no-match 'separator)

(global-corfu-mode)
;; =corfu=:1 ends here
