init.el

;; [[file:README.org::*Python][Python:1]]
;; Example error from pyright
;; --------------------------
;; /home/robb/tmp/errors.py/
;;   /home/robb/tmp/errors.py:1:1 - error: "foo" is not defined (reportUndefinedVariable)
;;   /home/robb/tmp/errors.py:1:1 - warning: Expression value is unused (reportUnusedExpression)
;;   /home/robb/tmp/errors.py:4:12 - error: Operator "+" not supported for types "str" and "Literal[1]"
;;     Operator "+" not supported for types "str" and "Literal[1]" (reportGeneralTypeIssues)
;; 2 errors, 1 warning, 0 informations
(with-eval-after-load 'compile
  (add-to-list 'compilation-error-regexp-alist-alist
               ;; It would be nice if we could also capture the
               ;; \\(error\\|warning\\) part as "KIND", but I got messed
               ;; up on it
               '(pyright "^[[:blank:]]+\\(.+\\):\\([0-9]+\\):\\([0-9]+\\).*$" 1 2 3))
  (add-to-list 'compilation-error-regexp-alist 'pyright))

;; Extra check commands for C-c C-v
(with-eval-after-load 'python
  (if (executable-find "mypy")
      (setq python-check-command "mypy"))
  (if (executable-find "pyright")
      (setq python-check-command "pyright")))

;; I ran into something similar to this on Windows:
;; https://github.com/jorgenschaefer/elpy/issues/733
;;
;; The culprit was "App Execution Aliases" with python and python3
;; redirecting to the windows store. Using:
;;
;;     winkey -> Manage app execution aliases -> uncheck python and python3
;;
;; fixed it.

;; Also on Windows - a `pip install` of `pyreadline3' is required to
;; make tab-completion work at all. It provides the `readline' import
;; symbol.

;; Virtualenvs - require .dir-locals.el to have e.g.:
;;   ((python-mode . ((python-shell-virtualenv-root . "/path/to/my/.venv"))))
;; However, this only operates on `run-python' shells.
;;
;; `pyvenv' solves the otherwise very annoying problem of getting
;; external tools like `compile' and `eshell' to also use our virtual
;; environment's python.  I may still use .dir-locals.el to set things
;; like the python-check-command on a per-project basis, though.
(when (package-installed-p 'pyvenv)
  (pyvenv-mode)
  ;; (add-hook 'pyvenv-post-activate-hooks 'pyvenv-restart-python)
  ;; (pyvenv-tracking-mode)
  ;; (setenv "WORKON_HOME" "~/.conda/envs")
  )

;; Enable semantic mode for more intelligent code parsing
;; https://www.gnu.org/software/emacs/manual/html_node/semantic/Semantic-mode.html
;; (add-hook 'python-mode-hook 'semantic-mode)

;; Don't mark the check command and virtualenv variables as unsafe
(put 'python-check-command 'safe-local-variable #'stringp)
(put 'python-shell-virtualenv-root 'safe-local-variable #'stringp)

;; (add-hook 'python-mode-hook 'eglot-ensure)
;; Python:1 ends here

;; [[file:README.org::*Microsoft Windows][Microsoft Windows:1]]
(when (eq system-type 'windows-nt)
  ;; Set a better font on Windows
  (set-face-attribute 'default nil :font "Hack NF-12")
  ;; Alternate ispell when we've got msys on Windows
  (setq ispell-program-name "c:/msys64/usr/bin/aspell.exe")
  ;; Set default shell to pwsh
  (setq explicit-shell-file-name "pwsh")
  ;; Enable use of Winkey as super
  (setq w32-pass-lwindow-to-system nil)
  (setq w32-lwindow-modifier 'super) ; Left Windows key
  (setq w32-pass-rwindow-to-system nil)
  (setq w32-rwindow-modifier 'super) ; Right Windows key
  ;; If we want to use a hotkey, we have to also register each
  ;; combination specifically, like this:
  (w32-register-hot-key [s-a])
  (w32-register-hot-key [s-b])
  (w32-register-hot-key [s-c])
  (w32-register-hot-key [s-d])
  (w32-register-hot-key [s-e])
  (w32-register-hot-key [s-f])
  (w32-register-hot-key [s-g])
  (w32-register-hot-key [s-h])
  (w32-register-hot-key [s-i])
  (w32-register-hot-key [s-j])
  (w32-register-hot-key [s-k])
  ;; s-l can NEVER be registered as a key combination, since Windows
  ;; handles it at a much lower level.
  ;; (w32-register-hot-key [s-l])
  (w32-register-hot-key [s-m])
  (w32-register-hot-key [s-n])
  (w32-register-hot-key [s-o])
  (w32-register-hot-key [s-p])
  (w32-register-hot-key [s-q])
  (w32-register-hot-key [s-r])
  (w32-register-hot-key [s-s])
  (w32-register-hot-key [s-t])
  (w32-register-hot-key [s-u])
  (w32-register-hot-key [s-v])
  (w32-register-hot-key [s-w])
  (w32-register-hot-key [s-x])
  (w32-register-hot-key [s-y])
  (w32-register-hot-key [s-z]))
;; Microsoft Windows:1 ends here

;; [[file:README.org::*macOS][macOS:1]]
(when (eq system-type 'darwin)
  ;; Uncomment this if we can't install Hack Nerd font
  ;; (set-face-attribute 'default nil :font "Menlo-14")
  (set-face-attribute 'default nil :font "Hack Nerd Font Mono-13")
  (exec-path-from-shell-initialize)

  ;; Better terminal emulation
  (require 'vterm)
  (add-hook 'vterm-mode-hook (lambda () (setq-local global-hl-line-mode nil)))

  (unless (version< emacs-version "29.0"))
    (setq pixel-scroll-precision-use-momentum t)
  )
;; macOS:1 ends here

;; [[file:README.org::*Linux][Linux:1]]
(when (eq system-type 'gnu/linux)
  (set-face-attribute 'default nil :font "Hack Nerd Font Mono-11")
  ;; (exec-path-from-shell-initialize)
  )
;; Linux:1 ends here

;; [[file:README.org::*Tramp][Tramp:1]]
(setq vc-handled-backends '(Git))
(setq remote-file-name-inhibit-locks t)
(setq tramp-inline-compress-start-size 1000)
(setq tramp-copy-size-limit 10000)
(setq tramp-verbose 1)

;; Without this line, we get the "Forbidden reentrant call of Tramp" bug: https://github.com/joaotavora/eglot/issues/859
(setq tramp-use-ssh-controlmaster-options nil)

;; Enable .dir-locals.el for remote files
;; REMINDME: This can case a HUGE slowdown when doing things like `project-find-file'
;; (setq enable-remote-dir-locals t)

(with-eval-after-load 'tramp
  (add-to-list 'tramp-remote-path "~/.local/bin")
  (add-to-list 'tramp-remote-path "~/.conda/envs/robbmann/bin")
  ;; (remove-hook 'find-file-hook 'vc-find-file-hook)
  ;; (add-to-list 'tramp-connection-properties
  ;;              (list (regexp-quote "/ssh:7p")
  ;;                    "remote-shell" "/usr/bin/ksh"))
  )
;; Tramp:1 ends here
