init.el

;; [[file:README.org::*TreeSitter][TreeSitter:1]]
;; TODO: Convert this to use-package
(require 'tree-sitter)
(require 'tree-sitter-langs)
(global-tree-sitter-mode)
(add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode)
;; TreeSitter:1 ends here

(provide 'init.el)
;;; init.el ends here
